---
kind: other
id: Properties.T:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData
source: html/444b1988-948f-29bb-56f4-15546e9609fa.htm
---
# IFCExtrusionCreationData Properties

Allows vertical shifting of breps when moving towards the origin.